{
  "hookFacts": [
    {
      "id": 1,
      "fact": "When the Bannings fly to England, the pilot's voice is that of Dustin Hoffman (Captain Hook) - \"This is your captain speaking...\""
    },
    {
      "id": 2,
      "fact": "The kissing couple who begin to float when some fairy dust lands on them were George Lucas and Carrie Fisher in a cameo."
    },
    {
      "id": 3,
      "fact": "Gutless, the male bearded pirate, who is locked in the \"Boo Box\" with scorpions, was played by Glenn Close."
    },
    {
      "id": 4,
      "fact": "Bob Hoskins bought beer for 300+ extras after a lengthy and complicated scene was cut."
    },
    {
      "id": 5,
      "fact": "The word \"bangarang\" is actually Jamaican slang for uproar, disorder, or disturbance."
    },
    {
      "id": 6,
      "fact": "Dustin Hoffman's three children make appearances in the movie. His youngest son, Max Hoffman played five-year-old Peter Pan. His daughter, Rebecca Hoffman played Jane in the play at the beginning of the movie, and his oldest son, Jake Hoffman played a little league player in Jack's baseball game."
    },
    {
      "id": 7,
      "fact": "Dustin Hoffman and Robin Williams' stunt doubles were named Keith. When director Steven Spielberg called for Keith to come to the set, both Keiths showed up. Eventually, Hoffman's stunt double changed his name from Keith to Keifo."
    },
    {
      "id": 8,
      "fact": "The shot in which the Captain's hook is fitted to his arm for the first time had to be done in one take as the flicker effect was achieved using rare, single use flash bulbs."
    },
    {
      "id": 9,
      "fact": "Peter and his family fly Pan Am airlines to London. Pan Am went out of business on December 4, 1991, exactly one week before the film's release on December 11, 1991."
    },
    {
      "id": 10,
      "fact": "Steven Spielberg originally asked Sir Richard Attenborough to play Tootles. Attenborough declined, as he was directing Chaplin (1992) at the time. Spielberg cast him as Dr. John Hammond in Jurassic Park (1993)."
    },
    {
      "id": 11,
      "fact": "Because Tinker Bell was often in the air, Julia Roberts had an assistant whose sole responsibility was cleaning her feet."
    },
    {
      "id": 12,
      "fact": "Rock star David Bowie turned down the role of Captain James Hook."
    },
    {
      "id": 13,
      "fact": "When Mr. Smee (Bob Hoskins) shouts \"Good morning, Neverland\" it is a nod towards Good Morning, Vietnam (1987), where Robin Williams said \"Good morning Vietnam\" repeatedly throughout the movie."
    },
    {
      "id": 14,
      "fact": "In 1985, composer John Williams and lyricist Leslie Bricusse worked on \"Hook\" as a stage musical. The project was scrapped after about ten songs were written. Only one song from the play, \"When You're Alone\", made it to the film. However, many of the play's themes appear in Williams' incidental music."
    },
    {
      "id": 15,
      "fact": "Along with Star Trek VI: The Undiscovered Country (1991), this is one of two films released in December 1991 to feature the line, \"Second star to the right and straight on till morning.\""
    },
    {
      "id": 16,
      "fact": "Dustin Hoffman based the voice of Captain Hook on that of the columnist William F. Buckley."
    },
    {
      "id": 17,
      "fact": "On occasion an author will create a character that represents himself. J.M.Barrie was no exception. If you want to know who Captain Hook's first mate is, \"it's me\" (It's Smee.)."
    },
    {
      "id": 18,
      "fact": "The child playing Peter Pan in the play at the beginning of the movie is actually a girl. This in an allusion to most live-action Peter Pan movies and stage plays which have a female in the title role."
    }
  ]
}
